export const letters = [
  "أ",
  "ب",
  "ت",
  "ث",
  "ج",
  "ح",
  "خ",
  "د",
  "ذ",
  "ر",
  "ز",
  "س",
  "ش",
  "ص",
  "ض",
  "ط",
  "ظ",
  "ع",
  "غ",
  "ف",
  "ق",
  "ك",
  "ل",
  "م",
  "ن",
  "ه",
  "و",
  "ي",
];

export const defaultLetterClass = 'letter border-2 text-black w-12 h-12  flex items-center justify-center rounded-md cursor-pointer select-none hover:scale-110 transition ease-in-out'


export const words = [
  {
    word: 'موز',
    hint: 'فاكهة صفراء يحبها القرود.'
  },
  {
    word: 'فيل',
    hint: 'حيوان ثديي ضخم ذو خرطوم.'
  },
  {
    word: 'هرم',
    hint: 'بناء قديم بناه المصريون القدماء.'
  },
  {
    word: 'القاهرة',
    hint: 'عاصمة مصر، موطن الأهرامات العظيمة.'
  },
  {
    word: 'الرياض',
    hint: 'عاصمة المملكة العربية السعودية.'
  },
  {
    word: 'عمان',
    hint: 'عاصمة الأردن، معروفة بآثارها القديمة.'
  },
  {
    word: 'بغداد',
    hint: 'عاصمة العراق، كانت مركز الخلافة العباسية.'
  },
  {
    word: 'مسقط',
    hint: 'عاصمة عمان، معروفة بساحلها الجميل.'
  },
  {
    word: 'مكة',
    hint: 'أقدس مدينة في الإسلام، مسقط رأس النبي محمد.'
  },
  {
    word: 'قرآن',
    hint: 'الكتاب المقدس في الإسلام.'
  },
  {
    word: 'رمضان',
    hint: 'شهر الصيام في الإسلام من الفجر حتى غروب الشمس.'
  },
  {
    word: 'زكاة',
    hint: 'شكل إلزامي من الصدقة في الإسلام.'
  },
  {
    word: 'هجرة',
    hint: 'هجرة النبي محمد من مكة إلى المدينة.'
  },
  {
    word: 'حج',
    hint: 'الحج السنوي إلى مكة، أحد أركان الإسلام الخمسة.'
  },
  {
    word: 'صلاة',
    hint: 'الصلاة التي تؤدى خمس مرات يوميًا في الإسلام.'
  },
  {
    word: 'عمرة',
    hint: 'زيارة إلى مكة يمكن أداؤها في أي وقت من السنة.'
  },
  {
    word: 'حلال',
    hint: 'أفعال أو أطعمة مسموحة وفقًا للشريعة الإسلامية.'
  },
  {
    word: 'سنة',
    hint: 'ممارسات وتعاليم النبي محمد.'
  },
  {
    word: 'شريعة',
    hint: 'القانون الإسلامي المستمد من القرآن والسنة.'
  },
  {
    word: 'فجر',
    hint: 'أول صلاة في اليوم تؤدى عند الفجر.'
  },
  {
    word: 'توحيد',
    hint: 'الإيمان بوحدانية الله في الإسلام.'
  },
  {
    word: 'عيد',
    hint: 'الأعياد الإسلامية مثل عيد الفطر وعيد الأضحى.'
  },
  {
    word: 'إمام',
    hint: 'قائد الصلاة في المسجد.'
  },
];
