export const letters = [
  "أ",
  "ب",
  "ت",
  "ث",
  "ج",
  "ح",
  "خ",
  "د",
  "ذ",
  "ر",
  "ز",
  "س",
  "ش",
  "ص",
  "ض",
  "ط",
  "ظ",
  "ع",
  "غ",
  "ف",
  "ق",
  "ك",
  "ل",
  "م",
  "ن",
  "ه",
  "و",
  "ي",
];

export const defaultLetterClass = 'letter border-2 text-black w-12 h-12  flex items-center justify-center rounded-md cursor-pointer select-none hover:scale-110 transition ease-in-out'


export const words = [
  {
    word: 'موز',
    hint: 'فاكهة صفراء يحبها القرود.'
  },
  {
    word: 'فيل',
    hint: 'حيوان ثديي ضخم ذو خرطوم.'
  },
  {
    word: 'هرم',
    hint: 'بناء قديم بناه المصريون القدماء.'
  },
  {
    word: 'القاهرة',
    hint: 'عاصمة مصر، موطن الأهرامات العظيمة.'
  },
  {
    word: 'الرياض',
    hint: 'عاصمة المملكة العربية السعودية.'
  },
  {
    word: 'عمان',
    hint: 'عاصمة الأردن، معروفة بآثارها القديمة.'
  },
  {
    word: 'بغداد',
    hint: 'عاصمة العراق، كانت مركز الخلافة العباسية.'
  },
  {
    word: 'مسقط',
    hint: 'عاصمة عمان، معروفة بساحلها الجميل.'
  },
  {
    word: 'مكة',
    hint: 'أقدس مدينة في الإسلام، مسقط رأس النبي محمد صلى الله عليه وسلم.'
  },
  {
    word: 'قرآن',
    hint: 'الكتاب المقدس في الإسلام.'
  },
  {
    word: 'رمضان',
    hint: 'شهر الصيام في الإسلام من الفجر حتى غروب الشمس.'
  },
  {
    word: 'زكاة',
    hint: 'شكل إلزامي من الصدقة في الإسلام.'
  },
  {
    word: 'هجرة',
    hint: 'هجرة النبي محمد صلى الله عليه وسلم من مكة إلى المدينة.'
  },
  {
    word: 'حج',
    hint: 'أحد أركان الإسلام الخمسة ويتم تأديته الى مكة المكرمة.'
  },
  {
    word: 'صلاة',
    hint: 'ركن الإسلام الذي تؤدى خمس مرات يوميًا في الإسلام.'
  },
  {
    word: 'عمرة',
    hint: 'زيارة إلى مكة يمكن أداؤها في أي وقت من السنة.'
  },
  {
    word: 'حلال',
    hint: 'أفعال أو أطعمة مسموحة وفقًا للشريعة الإسلامية.'
  },
  {
    word: 'سنة',
    hint: 'ممارسات وتعاليم النبي محمد.'
  },
  {
    word: 'شريعة',
    hint: 'القانون الإسلامي المستمد من القرآن والسنة.'
  },
  {
    word: 'فجر',
    hint: 'أول صلاة في اليوم تؤدى قبل الشروق.'
  },
  {
    word: 'توحيد',
    hint: 'الإيمان بوحدانية الله في الإسلام.'
  },
  {
    word: 'إمام',
    hint: 'قائد الصلاة في المسجد.'
  },
  {
    word: 'إسراء',
    hint: 'رحلة النبي محمد صلى الله عليه وسلم الليلية من المسجد الحرام إلى المسجد الأقصى.'
  },
  {
    word: 'معراج',
    hint: 'رحلة النبي محمد صلى الله عليه وسلم إلى السماوات السبع بعد الإسراء.'
  },
  {
    word: 'ابتلاء',
    hint: 'اختبار أو محنة يمر بها الإنسان لقياس إيمانه وصبره.'
  },
  {
    word: 'قيامة',
    hint: 'اليوم الذي يُبعث فيه الناس للحساب بعد الموت.'
  },
  {
    word: 'إخلاص',
    hint: 'نية العمل فقط لله دون الرياء أو طلب الثناء من الناس.'
  },
  {
    word: 'تكبير',
    hint: 'قول "الله أكبر" كجزء من الأذكار والعبادة.'
  },
  {
    word: 'مناسك',
    hint: 'الطقوس والأعمال المحددة في الحج والعمرة.'
  },
  {
    word: 'مؤمن',
    hint: 'شخص يصدق بالله وبرسوله ويتبع أوامر الدين.'
  },
  {
    word: 'سير',
    hint: 'قصص حياة الأنبياء والصالحين التي تعطي دروسًا وعبرًا.'
  },
  {
    word: 'شفاعة',
    hint: 'توسط النبي محمد صلى الله عليه وسلم لأمته يوم القيامة.'
  },
  {
    word: 'توبة',
    hint: 'العودة إلى الله والاستغفار بعد ارتكاب الذنوب.'
  },
  {
    word: 'صدقة',
    hint: 'تبرع بالمال أو الأشياء للمحتاجين كنوع من العبادة.'
  },
  {
    word: 'سحور',
    hint: 'الوجبة التي تُؤكل قبل الفجر خلال شهر رمضان استعدادًا للصيام.'
  },
  {
    word: 'فتوى',
    hint: 'حكم ديني يصدره عالم بناءً على نصوص الشريعة.'
  },
  {
    word: 'خوارج',
    hint: 'طائفة خرجت عن الخليفة علي بن أبي طالب بعد معركة صفين.'
  },
  {
    word: 'جنة',
    hint: 'مكان النعيم الذي يدخله المؤمنون بعد الموت.'
  },
  {
    word: 'نفاق',
    hint: 'إظهار الإيمان وإخفاء الكفر أو الخداع.'
  },
  {
    word: 'غسل',
    hint: 'الاغتسال الكامل الذي يجب في حالات معينة مثل الجنابة.'
  },
  {
    word: 'احتساب',
    hint: 'نية احتساب الأجر عند الله في كل عمل صالح.'
  },
  {
    word: 'بدعة',
    hint: 'إدخال أمور جديدة في الدين لم تكن موجودة على عهد النبي.'
  }
];
